name: "densenet_preprocess"
backend: "python"

input [
  {
    name: "img_in_bytes"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]
output [
  {
    name: "data_0"
    data_type: TYPE_FP32
    dims: [ 1, 3, 224, 224 ]
  }
]

instance_group [{ kind: KIND_CPU }]